Validation/HorizontalFilm/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1E6;

boundaryField
{
     upDown
    {
	type	empty;
    }
   right
    {
	type            fixedValue;
        value           uniform 1E6;
    }
   left
    {
    	type            zeroGradient;
    }
   frontAndBack 
    {
	type	empty; 
    }

}


// ************************************************************************* //
